{
  "backend/main.mo": "Empty Motoko actor serving as the ICP backend placeholder with no implemented methods.",
  "feature_evidence.json": "Feature evidence report mapping each frontend feature (API service, state store, landing page, sidebar, etc.) to their implementation files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "JSON dictionary providing one-sentence descriptions of every frontend source file, summarizing their purpose, key technologies, and notable implementation details.",
  "frontend/index.css": "Tailwind CSS entry file defining OKLCH-based CSS custom properties for light and dark theme color tokens including background, foreground, chart, and sidebar variables.",
  "frontend/index.html": "Minimal HTML shell for the CoFoundrAI Vite/React app, mounting the React root div and loading the main TSX entry point as an ES module.",
  "frontend/src/App.tsx": "Main application file configuring TanStack Router with all routes: a landing route at '/', and workflow pages (dashboard, simulation, brochure, report, linkedin, autopost, metrics) nested under a shared AppLayout with Sidebar and WorkflowTracker, wrapped in ToastProvider.",
  "frontend/src/components/GlassCard.tsx": "Reusable glassmorphism card component with backdrop-blur, optional 3D hover lift effect, and configurable glow color variants (cyan, violet, emerald).",
  "frontend/src/components/Sidebar.tsx": "Persistent sticky sidebar navigation with links to all 7 workflow pages, active route highlighting with cyan gradient, CoFoundrAI logo, and a collapse toggle that switches between full-width and icon-rail modes.",
  "frontend/src/components/ToastProvider.tsx": "Global toast notification system providing a React context with showSuccess, showError, and showInfo methods; toasts auto-dismiss after 4 seconds, support manual close, and stack at the top-right corner with type-specific styling.",
  "frontend/src/components/WorkflowTracker.tsx": "Renders a horizontal step-by-step workflow tracker with 7 steps (Analyze, Simulate, Brochure, Report, LinkedIn, Auto-Post, Metrics), displaying idle/loading/done/error states with icons and color coding from the Zustand store.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, returning either an authenticated or anonymous actor based on the current Internet Identity, and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useCoFoundrStore.ts": "Zustand store defining global app state for the CoFoundr workflow, including data results, per-step statuses (idle/loading/done/error), and error messages for all 7 pipeline steps.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider using DFINITY's AuthClient, exposing login/clear functions, identity state, and login status to child components.",
  "frontend/src/hooks/useToast.ts": "Simple hook that retrieves the ToastContext, throwing an error if used outside a ToastProvider.",
  "frontend/src/index.css": "Global stylesheet importing Inter and Space Grotesk fonts, defining Tailwind base/component/utility layers, dark-mode CSS custom properties, custom scrollbar styles, glass-card and gradient-text utilities, and keyframe animations.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers around the root App component.",
  "frontend/src/pages/AutoPostPage.tsx": "Page component that previews the generated LinkedIn post and allows the user to publish it via the autopost API, showing loading/success/error states and navigation back to the LinkedIn post editor.",
  "frontend/src/pages/BrochurePage.tsx": "Page that lets users generate an AI brochure image for their startup idea using the `postImage` API, displaying loading state, the resulting image, and a download link.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page where users input a startup idea, trigger multi-agent AI analysis via `postAnalyze`, and view categorized result cards (business, market, tech, risk, validation).",
  "frontend/src/pages/LandingPage.tsx": "Marketing landing page with an animated SVG/CSS background, feature highlights, and a CTA button that navigates to the dashboard.",
  "frontend/src/pages/LinkedInPage.tsx": "Page for generating AI-crafted LinkedIn posts from analysis results via `postLinkedIn` and optionally auto-publishing them to LinkedIn via `postAutopost`.",
  "frontend/src/pages/MetricsPage.tsx": "Page that fetches and auto-refreshes MCP system metrics (agent executions, performance, request counts) every 30 seconds, displaying them as stat cards.",
  "frontend/src/pages/ReportPage.tsx": "React page that generates and displays a PDF report from the stored analysis result, allowing users to preview it in a dialog or download it. Shows a redirect prompt if no analysis exists yet.",
  "frontend/src/pages/SimulationPage.tsx": "React page that auto-triggers a market simulation API call on mount using the stored analysis result, then renders line and bar charts for market growth and success probability.",
  "frontend/src/services/api.ts": "Centralized API service module that defines typed interfaces and async functions (postAnalyze, postSimulate, postImage, postReport, postLinkedIn, postAutopost, getMcpMetrics) with a 60-second timeout fetch wrapper targeting a local FastAPI backend.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom brand colors, glassmorphism/glow box shadows, display fonts, animation keyframes, and plugins for typography, container queries, and animate.",
  "project_state.json": "Project state snapshot describing CoFoundrAI's architecture, tech stack, existing features, and image requirements, used to track versioned build progress across the multi-step AI workflow frontend."
}